---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.Space
source: html/b2c8970e-e554-8d73-06db-b65712c8a2e5.htm
---
# Autodesk.Revit.DB.Mechanical.Space

Provides access to the space topology in Autodesk Revit.

## Syntax (C#)
```csharp
public class Space : SpatialElement
```

## Remarks
The space object can be queried for its boundary for use in space planning tools.